// lib/constants.dart

/// กลุ่มโรคร้ายแรงกลุ่มที่ 1
const List<String> criticalIllnessGroup1 = [
  "โรคหลอดเลือดหัวใจตีบที่รักษาด้วยการสวนหลอดเลือดหัวใจ",
  "โรคหลอดเลือดสมองที่ต้องได้รับการผ่าตัดลอกหลอดเลือดแดงคาโรติด",
  "โรคมะเร็งระยะไม่ลุกลาม",
  "โรคหลอดเลือดสมองโป่งพองที่รักษาโดนใช้ขดลวดผ่านสายสวนทางหลอดเลือด",
  "โรคหลอดเลือดสมองที่ได้รับการรักษาโดยวิธีใส่สายสวนเส้นเลือดแดงบริเวณคอ"
];

/// กลุ่มโรคร้ายแรงกลุ่มที่ 2
const List<String> criticalIllnessGroup2 = [
  "โรคสมองเสื่อมชนิดอัลไซเมอร์",
  "โรคโลหิตจางจากกระดูกไม่สร้างเม็ดโลหิต",
  "โรคเยื่อหุ้มสมองและไขสันหลังอักเสบจากเชื้อแบคทีเรีย",
  "เนื้องอกในสมองชนิดไม่ใช่มะเร็ง",
  "ตาบอด",
  "โรคมะเร็งระยะลุกลาม"
  "โรคกล้ามเนื้อหัวใจ",
  "ตับวาย",
  "โรคหลอดลมปอดอุดกลั้นเรื้อรังขั้นรุนแรง/โรคปอดระยะสุดท้าย",
  "ภาวะโคม่า",
  "การผ่าตัดเส้นเลือดเลี้ยงกล้ามเนื้อหัวใจ",
  "กล้ามเนื้อหัวใจตายเฉียบพลันจากการขาดเลือด",
  "การผ่าตัดลิ้นหัวใจโดยวิธีการเปิดหัวใจ",
  "ไตวายเรื้อรัง",
  "การสูญเสียการได้ยิน",
  "การสูญเสียการดำรงชีพอย่างอิสระ",
  "การทุพพลภาพถาวรสิ้นเชิง",
  "การสูญเสียความสามารถในการพูด",
  "แผลไหม้ฉกรรจ์",
  "การบาดเจ็บที่ศีรษะอย่างรุนแรง",
  "การผ่าตัดเปลี่ยนอวัยวะหรือปลูกถ่ายไขกระดูก",
  "โรคของเซลล์ประสาทควบคุมการเคลื่อนไหว",
  "โรคระบบเซลล์ประสาทมัลติเพิลสะเคลอโรลิส",
  "โรคกล้ามเนื้อเสื่อม",
  "โรคไวรัสตับอักเสบขั้นรุนแรง",
  "โรคเส้นเลือดหัวใจตีบ",
  "อัมพาตของกล้ามเนื้อแขนหรือขา",
  "โรคพาร์กินสัน",
  "โรคแรงดันในหลอดเลือดแดงปอดสูงแบบปฐมภูมิ",
  "ภาวะข้ออักเสบรูมาตอยด์ชนิดรุนแรง",
  "โรคหลอดเลือดสมองแตกหรืออุดตัน",
  "การผ่าตัดเส้นเลือดแดงใหญ่เออร์ต้า",
  "ไตอักเสบลูปูสจากโรคซิสเต็มมิคลูปูสอิริเธมาโตซูส",
  "สมองอักเสบจากเชื้อไวรัส",
  "ภาวะอะแพลลิก (Apallic Syndrome หรือ Vegetative State)",
  "โรคหลอดเลือดสมองโป่งพองที่ต้องรักษาโดยการผ่าตัด",
  "การฉีกขาดของรากประสาทต้นแขน",
  "โรคโปลิโอ",
  "การผ่าตัดกระดูกสันหลังคดที่ไม่ทราบสาเหตุ",
  "ภาวะตับอ่อนอักเสบที่กลับไปเป็นซ้ำหรือเรื้อรัง",
  "โรคเท้าช้าง",
  "โรคถุงน้ำในไต",
  "โรคเนื้อเยื่อพังผืดอักเสบติดเชื้อและเป็นเนื้อตาย",
  "โรคหนังเเข็งชนิดลุกลาม",
  "โรคลำไส้อักเสบเป็นแผลรุนแรง"
];

/// กลุ่มโรคร้ายแรงในเด็ก
const List<String> criticalIllnessChild = [
  "โรคไข้รูมาติกที่มีอาการลิ้นหัวใจบกพร่อง",
  "โรคคาวาซากิที่มีอาการแทรกซ้อนทางหัวใจ",
  "โรคเบาหวานชนิดที่หนึ่ง/เบาหวานชนิดพึ่งอินซูลิน",
  "โรคหอบหืดขั้นรุนแรง",
  "โรคเลือดไหลไม่หยุดชนิดเอและบี",
  "โรคกระดูกเปราะพันธุกรรม",
  "โรคมือ เท้า ปาก ที่มีอาการแทรกซ้อนรุนแรง",
  "โรคไตรั่ว ชนิดมีอาการโปรตีนรั่วในปัสสาวะ",
  "โรคสติลล์",
  "โรคบาดทะยัก",
  "โรคลมชักรุนแรง/ภาวะชักต่อเนื่อง",
  "โรคกล้ามเนื้อลีบจากไขสันหลังเสื่อมชนิดที่หนึ่ง",
  "โรคพิษสุนัขบ้า",
  "โรคติดเชื้อของเยื่อบุหัวใจ ลิ้นหัวใจ และหลอดเลือด",
  "กลุ่มอาการไอเซนเมนเกอร์ขั้นรุนแรง"
];
